app/views/admin/addresses/index.html.erb

<% if @filtered %>
	<h2 style="text-align:center;"><%= "#{User.find(@params_user_id).first_name} #{User.find(@params_user_id).last_name}\'s Addresses" %> </h2>
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 331]]