app/views/order_contents/index.html.erb

SELECT  "products".* FROM "products"  WHERE "products"."id" = ? LIMIT 1  [["id", 27]]
---
				<div class="col-xs-6 col-xs-offset-2">
					<h4><%= Product.find(item).title %></h4>