app/views/users/_edit_user_form.html.erb

SELECT "states".* FROM "states"
---
      <%= address.label :state %>
      <%= address.collection_select(:state, State.all, :name, :name, :include_blank => true) %>