app/views/users/_user_form.html.erb

			<%= address.label :state %>
			<%= address.collection_select(:state, State.all, :name, :name, :include_blank => true) %>
---
SELECT "states".* FROM "states"