app/controllers/products_controller.rb

  def index

    @products = params[:category_id].blank? ? Product.paginate(page: params[:page], :per_page => 12) : Product.where("category_id = ?", params[:category_id]).paginate(page: params[:page],:per_page => 100)
    @categories = Category.all.map { |i| [i.name, i.id]}
---
SELECT  "products".* FROM "products"  WHERE "products"."id" = ? LIMIT 1  [["id", 3]]
SELECT "categories".* FROM "categories"