app/controllers/users_controller.rb

  def create
    @user = User.new(whitelisted_params)
    if @user.save
---
INSERT INTO "users" ("created_at", "email", "first_name", "last_name", "phone", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2014-10-19 00:34:55.226332"], ["email", "abhi@abhi.com"], ["first_name", "abhinav"], ["last_name", "sivasailam"], ["phone", 123456789], ["updated_at", "2014-10-19 00:34:55.226332"]]

  def set_defaults
    addresses = params[:user][:addresses_attributes]
    billing = params[:user][:billing_id]
    shipping = params[:user][:shipping_id]


    if billing
      billing_street = addresses[billing][:street_address]
      @user.billing = @user.addresses.find_by(street_address: billing_street)
    end
    if shipping
      shipping_street = addresses[shipping][:street_address]
      @user.shipping = @user.addresses.find_by(street_address: shipping_street)
    end

    @user.save
---
UPDATE "addresses" SET "city" = ?, "street_address" = ?, "updated_at" = ? WHERE "addresses"."id" = 759  [["city", "likes"], ["street_address", "tommy"], ["updated_at", "2014-10-19 02:42:11.067336"]]