app/views/admin/users/_order_history.html.erb

SELECT "orders".* FROM "orders"  WHERE "orders"."user_id" = ?  [["user_id", 331]]
---

		<% @user.orders.each do |order| %>