app/views/admin/users/index.html.erb

				<% if user.default_billing_address_id %>
					<td><%= Address.find(user.default_billing_address_id).city %></td>
---
SELECT  "addresses".* FROM "addresses"  WHERE "addresses"."id" = ? LIMIT 1  [["id", 321]]

				<% end %>
				<td><%= link_to user.orders.where(is_placed: true).count, "#" %></td>
---
SELECT  "orders".* FROM "orders"  WHERE "orders"."user_id" = ? AND "orders"."is_placed" = 't'  ORDER BY "orders"."id" DESC LIMIT 1  [["user_id", 320]]
SELECT COUNT(*) FROM "orders"  WHERE "orders"."user_id" = ? AND "orders"."is_placed" = 't'  [["user_id", 320]]